import hanlp

url = 'D:\\hanlp'
sim = hanlp.load(url)
two_dimension_arr = [
    # ['请介绍鹏博', '请介绍鹏博'],
    # ['请介绍NLP', '请介绍NLP'],
    ['请介绍一下河北吧', '请介绍一下河北'],
    ['河北', '河南'],
    ['介绍下河北', '介绍下河南'],
    ['请您介绍下河南', '介绍下河北'],
    ['请介绍下河北', '介绍一下河北省'],
    ['鹏博', '鹏博集团'],
    ['请好好介绍一下鹏博集团', '请介绍下子鹏博集团'],
    ['请介绍下子鹏博集团', '请好好介绍一下鹏博集团'],
    # ['请介绍一下黑龙江省哈尔滨市', '介绍下哈尔滨'] # 0
    ['请介绍下黑龙江省哈尔滨', '介绍一下黑龙江哈尔滨']
]

res = sim(two_dimension_arr)

# [0.984276533126831, 0.008415162563323975, 0.0, 0.0, 0.9795836210250854, 0.9829277992248535, 0.9847086668014526, 0.9839303493499756]
print(res)
max = max(res)
if max > 0.9:
    print(two_dimension_arr[res.index(max)][1])

print(max)